# Задача № 1
# За день машина проезжает n килиметров. Сколько дней нужно, чтобы
# проехать маршрут длинной m километров? При решении задачи нельзя пользоваться 
# условной инструкцией if и циклами.
# input 
# n = 700
# m = 750
# output
# 2

n = 700
m = 750
print(m // n + 1)